
import Foundation
import SwiftUI

let story = Story(pages: [
    StoryPage(title:"Начало на Приключението",
        
        label://0
        """
        Мики Маус пристига на входа на гората. Табела го предупреждава: „Само най-смелите могат да преминат.“ 🪧 Той има две възможности:
            
        """,
    choices: [
        Choice(text:"Да влезе в гората с увереност🗡️",destination: 1),
        Choice(text:"Да потърси информация от местния мъдрец в селото🧙",destination: 2)
        ]
    ),
    
    StoryPage(title: " Среща с Вълшебните Гъби 🍄 ",
        label://1
        """
        Мики забелязва кръг от светещи гъби. 🍄 Една от тях проговаря и казва, че може да му даде сила или мъдрост.🍄  Мики трябва да избере:

        """,
        choices: [
            Choice(text:"Да избере силата 💪",destination: 4),
            Choice(text: "Да избере мъдростта 🧠", destination: 3)
            
        ]
    ),
    
    StoryPage(title:"Селският Мъдрец 🧙",
        label: //2
        """
                🧙: Мъдрецът казва на Мики за старите заклинания на гората и му дава вълшебен медальон, който да го пази от зли духове👻. След като се подготви, Мики влиза в гората.
        
        """,
        choices:[
            Choice(text: "Продължи 🌳", destination: 4)
        ]
    ),
    
    StoryPage(title:"Пъзелът на Старата Фея 🧚‍♂️",
        label: //3
        """
        Мики среща стара фея 🧚‍♂️, която му предлага да му помогне, ако реши нейната загадка. Ако избере верния отговор, ще получи съкровен талисман, който ще го води по правилния път. Въпросът е колко измерна е магическата гора?

        """,
        choices:[
            Choice(text:"Четири измерна и толкова!",destination: 5),
            Choice(text: "Повече от 5 измерна гора, защото с магията всичко е възможно. ✨", destination: 6)
        ]
    ),
    
    StoryPage( title: "Среща със Злия Дракон 🐉",
        label://4
        """
        Мики стига до пещера, където дракон пази входа към последната част на гората. Трябва да реши как да премине.
        """,
        choices: [
            Choice(text: "Да се бие с дракона 🗡️", destination: 7),
            Choice(text: "Да използва медальона 🏅", destination: 7)
        ]
    ),
    
    StoryPage(title: "Омагьосаното Езеро",
        label: //5
        """
        Мики вижда блестящо езеро, което му разкрива тайната на съкровището. То е скрито под Дървото на желанията в сърцето на гората 🌳.

        """,
        choices:[
            Choice(text: "Продължи към реката 💧", destination: 7)
        ]
    ),
    
    StoryPage(title:"Лабиринтът на Заблудата",
        label: //6
        """
        Мики се лута в лабиринта и среща дух на стар пътешественик, който му помага срещу малка услуга.
        """,
        choices:[
            Choice(text: "Продължи", destination: 7)
        ]
    ),
    StoryPage(title:"Дървото на Желанията 🌳",
        label: //7
        """
        Мики стига до Дървото на желанията и трябва да избере своето желание.
        """,
        choices: [
            Choice(text:"Да пожелае съкровище 💰",destination: 8),
            Choice(text:"Да пожелае приятелите му да са в безопасност", destination: 9),
            Choice(text: "Да избере приключенията да продължат", destination: 10)
        ]
    ),
    
    StoryPage(title: "Край: Съкровището на желанията 💰",
        label: //8 end 1
        """
        Мики получава злато и скъпоценности, но остава в гората завинаги.
        """,
        choices: [
            Choice(text: "Върни се в началото.", destination: 0)
        ]
    ),
    StoryPage(title:"Край: Щастие и спокойствие",
        label: //9 end 2
        """
        Мики се завръща щастлив и с ново чувство на сила, знаейки, че приятелите му са в безопасност.
        """,
        choices: [
            Choice(text: "Върни се в началото.", destination: 0)
        ]
    ),
    
    StoryPage(title:"Край: Нова глава в приключенията",
        label: //10 end 3
        """
        Мики остава в гората и продължава с нови вълнуващи предизвикателства. 
        Очаквай новите приключения на Мики в омагосанта гора - част 2!
        """,
        choices: [
            Choice(text: "Върни се в началото.", destination: 0)
        ]
    ),
    
    
])
